Repository: SurniaUlula/wpsso-tune-image-editors
Catalog: languages/wpsso-tune-image-editors-*.po
Languages: fr_fr

# option value
source: GD and ImageMagick
fr_fr: GD et ImageMagick

# option value
source: GD Only
fr_fr: GD uniquement

# option value
source: ImageMagick and GD
fr_fr: ImageMagick et GD

# option value
source: ImageMagick Only
fr_fr: ImageMagick uniquement

# lib file description
source: WP Image Editors
fr_fr: Éditeurs d'image

# plugin description
source: WPSSO Core add-on to provide tuning options for the WordPress image editors and PHP image extensions.
fr_fr: Extension d'ajout WPSSO Core pour fournir des options de réglage pour les éditeurs d'image WordPress et les extensions d'image PHP.

source: By default, WordPress uses the ImageMagick editor first (provided the PHP "imagick" extension is loaded), and uses the GD editor as a fallback.
fr_fr: Par défaut, WordPress utilise d'abord l'éditeur ImageMagick (à condition que l'extension PHP "imagick" soit chargée), et utilise l'éditeur GD comme solution de repli.

source: This option allows you to select a different default editor list for WordPress.
fr_fr: Cette option vous permet de sélectionner une autre liste d'éditeurs WordPress par défaut.

source: %s hooks the WordPress 'image_make_intermediate_size' filter to adjust and sharpen images.
fr_fr: %s accroche le filtre WordPress 'image_make_intermediate_size' pour ajuster et affûter les images.

source: You can change the priority at which these adjustments are made, to process images before / after other image processing plugins or custom filter hooks.
fr_fr: Vous pouvez modifier la priorité à laquelle ces ajustements sont effectués, pour traiter les images avant / après d'autres extensions de traitement d'image ou des crochets de filtres personnalisés.

source: Status of the %1$s editor in the WordPress '%2$s' array.
fr_fr: Statut de l'éditeur %1$s dans le tableau WordPress '%2$s'.

source: By default, WordPress uses the ImageMagick editor first, as editor #1 in the '%s' array.
fr_fr: Par défaut, WordPress utilise d'abord l'éditeur ImageMagick comme éditeur # 1 dans le tableau '%s'.

source: Status of the PHP "%s" extension module.
fr_fr: Statut du module d'extension PHP "%s".

source: If the WordPress %1$s editor is available, but the PHP "%2$s" extension is not loaded, contact your hosting provider and ask to have the PHP "%2$s" extension installed.
fr_fr: Si l'éditeur de WordPress %1$s est disponible, mais que l'extension PHP "%2$s" n'est pas chargée, contactez votre fournisseur d'hébergement et demandez l'installation de l'extension PHP "%2$s".

source: Apply image adjustments for resized %1$s images using %2$s.
fr_fr: Appliquez les réglages d'image pour les images %1$s redimensionnées à l'aide de %2$s.

source: Contrast leveling further enhances images by adjusting the pixel colors to span the entire range of available colors.
fr_fr: Le nivellement du contraste améliore les images d'avantage en ajustant les couleurs des pixels pour couvrir toute la gamme des couleurs disponibles.

source: The resized image compression quality as a positive integer value between 1 and 100. The recommended value is 90 to 95.
fr_fr: La qualité de compression de l'image redimensionnée est une valeur entière positive comprise entre 1 et 100. La valeur recommandée est de 90 à 95.

source: The sharpening sigma can be any floating-point value, from 0.1 for almost no sharpening, to 3 or more for severe sharpening.
fr_fr: Le sigma d'affûtage peut être n'importe quelle valeur en flottante, de 0.1 pour presque pas d'affûtage, à 3 ou plus pour un affûtage sévère.

source: A sharpening sigma value between 0.5 and 1.0 is recommended.
fr_fr: Une valeur sigma d'affûtage comprise entre 0.5 et 1.0 est recommandée.

source: The sharpening radius is an integer value, generally one to two times the sharpening sigma value.
fr_fr: Le rayon d'affûtage est une valeur entière, généralement une à deux fois la valeur sigma d'affûtage.

source: The best sharpening radius depends on the resized image resolution, and for this reason, the recommended value is 0 (auto).
fr_fr: Le meilleur rayon d'affûtage dépend de la résolution de l'image redimensionnée et, pour cette raison, la valeur recommandée est 0 (auto).

source: The amount (ie. strength) of the sharpening effect. A larger value increases the contrast of sharpened pixels.
fr_fr: La quantité (c'est-à-dire la force) de l'effet d'affûtage. Une valeur plus grande augmente le contraste des pixels affûtés.

source: The default value is 1.0, and the recommended range is between 0.8 and 1.2.
fr_fr: La valeur par défaut est 1.0 et la plage recommandée est de 0.8 à 1.2.

source: Minimum contrast required for a pixel to be considered an edge pixel for sharpening.
fr_fr: Contraste minimal requis pour qu'un pixel soit considéré comme un pixel de contour à affûter.

source: Higher values (closer to 1) allow sharpening only in high-contrast regions, like strong edges, while leaving low-contrast areas unaffected.
fr_fr: Des valeurs plus élevées (plus proches de 1) permet d'affûter uniquement dans les zones à contraste élevée, comme les bordures fortes, et ignorer les zones à faible contraste.

source: Lower values (closer to 0) allow sharpening in relatively smoother regions of the image.
fr_fr: Les valeurs inférieures (plus proches de 0) permettent d'affûter les zones relativement plus lisses de l'image.

source: A value of 0 may be desirable to retain fine skin details in portrait photographs.
fr_fr: Une valeur de 0 peut être souhaitable pour conserver les détails fins de la peau dans les photos de portrait.

# option label
source: Adjustment Filter Priority
fr_fr: Priorité du filtre d'ajustement

# option label
source: Contrast Leveling
fr_fr: Nivellement de contraste

# option label
source: Compression Quality
fr_fr: Qualité de compression

# option label
source: Sharpening Sigma
fr_fr: Sigma d'affûtage

# option comment
source: recommended value is %1$s to %2$s
fr_fr: la valeur recommandée est de %1$s à %2$s

# option label
source: Sharpening Radius
fr_fr: Rayon d'affûtage

# option comment
source: recommended value is 0 (auto)
fr_fr: la valeur recommandée est 0 (auto)

# option label
source: Sharpening Amount
fr_fr: Quantité d'affûtage

# option label
source: Sharpening Threshold
fr_fr: Seuil d'affûtage

source: When activating the add-on or changing these options, please do not forget to <a href="%s">regenerate all image thumbnails / image sizes</a> to see the results.
fr_fr: Lorsque vous activez l'ajout ou modifiez ces options, n'oubliez pas de <a href="%s">régénérer toutes les images / tailles d'image</a> pour voir les résultats.

# metabox title
source: WordPress Settings
fr_fr: Réglages WordPress

# metabox title
source: PHP Extension Settings
fr_fr: Réglages d'extension PHP

# option label
source: Default WordPress Image Editor(s)
fr_fr: Éditeur(s) d'image WP par défaut

source: Used as editor #%d
fr_fr: Utilisé comme éditeur #%d

source: Not used
fr_fr: Non utilisé

source: Loaded
fr_fr: Chargé

source: Not loaded
fr_fr: Non chargé

# option label
source: WordPress %s Editor
fr_fr: Éditeur WordPress %s

# option label
source: PHP %s Extension
fr_fr: Extension PHP %s

# metabox title
source: %s Resized Images
fr_fr: Images redimensionnées %s

# option label
source: Adjust %s Images
fr_fr: Ajuster les images %s

source: %1$s is an add-on for the %2$s plugin &mdash; please install and activate the %3$s plugin before activating %4$s.
fr_fr: %1$s est un ajout pour l'extension %2$s &mdash; SVP installer et activer l'extension %3$s avant d'activer %4$s.

source: The %1$s add-on requires the %2$s plugin &mdash; install and activate the %3$s plugin or <a href="%4$s">deactivate the %5$s add-on</a>.
fr_fr: L'ajout %1$s requiert l'extension %2$s &mdash; installer et activer l'extension %3$s ou <a href="%4$s">désactiver l'ajout %5$s</a>.

source: The %1$s version %2$s add-on requires %3$s version %4$s or newer (version %5$s is currently installed).
fr_fr: L'ajout %1$s version %2$s requiert %3$s version %4$s ou plus récente (version %5$s est actuellement installée).

source: WPSSO Core add-on to provide tuning options for the WordPress image editors and PHP image extensions.
fr_fr: Extension d'ajout WPSSO Core pour fournir des options de réglage pour les éditeurs d'image WordPress et les extensions d'image PHP.
